{
    "todo_1": {
        "_id": "recipie_1",
        "name": "Spaghetti Carbonara",
        "image": "https://static01.nyt.com/images/2021/02/14/dining/carbonara-horizontal/carbonara-horizontal-master768-v2.jpg?width=1280&quality=75&auto=webprecipe1.jpg",
        "description": "A classic Italian pasta dish made with eggs, cheese, pancetta, and pepper."
    },
    "todo_2": {
        "_id": "recipie_2",
        "name": "Chicken Alfredo",
        "image": "https://www.budgetbytes.com/wp-content/uploads/2022/07/Chicken-Alfredo-above-500x500.jpg",
        "description": "Creamy and rich, this chicken Alfredo recipe is perfect for a family dinner."
    },
    "todo_3": {
        "_id": "recipie_3",
        "name": "Vegetable Stir-fry",
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2008/01/Vegetable-stir-fry-b669c05.jpg",
        "description": "A quick and healthy meal full of fresh vegetables and savory sauce."
    },
    "9f0d6863-a012-4acd-8de5-8475b63e66e1": {
        "_id": "9f0d6863-a012-4acd-8de5-8475b63e66e1",
        "name": "Fried Chicken",
        "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Crispy-Fried-Chicken_EXPS_TOHJJ22_6445_DR-_02_03_11b.jpg",
        "description": "A quick and healthy meal full of fresh vegetables and savory sauce.",
        "Ingredients": "Chicken: 3 lb drumsticks or thighs, 4 cups whole milk, can sub with water, 1/4 cup salt, 8 cloves garlic, 2 tbsp black peppercorns, 3 bay leaves Seasoning Mix: 2 cups flour, you can substitute with equal amounts Gluten-Free Four – Bobs Red Mill or King Arthur is recommended, 2 cups cornstarch, 2 tbsp kosher salt, 1/2 tbsp white pepper, 1 tbsp black pepper, 1 tbsp garlic powder, 1 tbsp onion powder, 1/2 tbsp cayenne pepper, 1 tbsp baking powder Wet Batter, 1 cup seasoning mix, 1 cup water, cold",
        "Instructions": "1.Pierce chicken carefully with a knife and brine with whole milk (or water), salt, garlic, black peppercorns, and bay leaves. Brine for 2-3 hours or overnight for best results. 2.In a large mixing bowl, combine flour, cornstarch, kosher salt, white pepper, black pepper, garlic powder, onion powder, cayenne pepper and baking powder and whisk until combined. 3.Take 1 cup of your seasoning mix and combine in a separate bowl with cold water and mix until smooth. 4.Remove the chicken from the brine and spoon a few tablespoons of brine into the seasoning mix and rub together with your hands to create small clumps. These craggily bits will add extra texture to the chicken. 5.Dip each piece of chicken in the wet batter and let any excess drip off. Immediately dredge in seasoning mix and press the mix into the chicken until completely coated. Let rest on a baking sheet while you heat up your oil. 6.In a large cast iron pan, dutch oven, or heavy bottomed pan/wok, fry chicken at 350F for 8-12 minutes (depending on size of the chicken) until the internal temperature reads 165F."
    }
}